## staging: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-09-28T19:58:50Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:005133826942:rpjvmf2ukd/" -> (known after apply)
      ~ id            = "y5n3kw" -> (known after apply)
      ~ invoke_url    = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-09-28T19:58:50Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "y5n3kw" -> (known after apply)
        id                    = "ags-rpjvmf2ukd-staging"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>